[
    {
        "name": "Juliana Biju",
        "designation": "Vice Chairperson - 2017",
        "img": "juliana.jpg",
        "body": "For me, it was a coincidence. Even I was among those who thought spending money for membership in any organisation was a waste until I got to experience IEEE. I was lucky to be part of a WIE event of Kochi hub before being an IEEE member because our SB WIE chairperson, Fathima Nazrin gave me that opportunity. Straight after that, I got into the IEEE LINK team and that's how I got to know the opportunities this organisation provides.  Now when I look back, IEEE made me realise my passion. IEEE moulded me into what I am today. Moreover, it gave me a chance to leave a mark. I'm so glad that it happened in my life."
    },
    {
        "name": "Sahil Sameer",
        "img": "sahil.jpeg",
        "designation": "Secretary - 2018",
        "body": "The deep quest to associate with a student-run organization during my undergrad has fortunately taken me to IEEE SB MEC, and the journey from there has been simply remarkable.\nIt’s a pack of assorted sweets that has the capacity to quench the cravings of every single associated stakeholder.\nThe chapter has made a remarkable mark in coming up with novel initiatives and the number of international laurels it has bagged recently is a true testimonial of the hard work and dedication the junior batches are putting in to take forward the legacy.\n The future is exciting."
    },
    {
        "name": "Sreehari A S",
        "designation": "Chairperson - 2019",
        "img": "sreehari.jpg",
        "body": "IEEE MEC SB had been the single most wonderful journey from being a young volunteer with a lot of aspirations and hope to mould me as a passion-driven chairman of the student branch. The 3 years showed me the best platform to showcase my skills, develop with peers and bring out the best in me and that's what MEC SB is to anyone who comes up. Cheers to the team that follows and happy volunteering."
    }
]